app/controllers/buddies_controller.rb

INSERT INTO "buddies" ("approval_id", "created_at", "request_id", "updated_at", "status") VALUES(2, '2010-11-26 04:40:35.205552', 2, '2010-11-26 04:40:35.205552', 'ACTIVE') RETURNING "id"
---
  def add
  	buddyId = params[:buddyId]
  	buddy = Buddy.new
  	buddy.request_id = current_user.id
  	buddy.approval_id = buddyId
  	buddy.status = Buddy::PENDING
  	buddy.save

SELECT * FROM "buddies" WHERE ("buddies".request_id = 2)
---
  def my_buddies
  	@my_buddies = Buddy.find_my_buddies(current_user.id, true)

SELECT * FROM "buddies" WHERE (request_id = '2' and approval_id = 2)
UPDATE "buddies" SET "updated_at" = '2010-11-26 05:21:31.588457', "status" = 'ACTIVE' WHERE "id" = 4
UPDATE "users" SET "updated_at" = '2010-11-26 05:20:38.079791', "perishable_token" = 'PvKL3gMEXAht9OQmVwYi', "last_request_at" = '2010-11-26 05:20:38.078904' WHERE "id" = 2
---
  def confirm_buddy
  	buddy = Buddy.all(:conditions => ["request_id = ? and approval_id = ?", params[:buddyId], current_user.id]).first()
  	buddy.status = params[:status]
  	!buddy.save