app/controllers/check_list_controller.rb

INSERT INTO "checklists" ("name", "expiration_date", "created_at", "updated_at", "owner_id", "active") VALUES('Big awesome', '2010-11-24', '2010-11-25 18:27:41.604467', '2010-11-25 18:27:41.604467', 1, 't') RETURNING "id"
---
  def create
  	@checklist = Checklist.new(params[:checklist])
  	@checklist.owner_id = current_user.id
  	if @checklist.save

SELECT * FROM "checklists" WHERE (owner_id = 1) ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "checklists" WHERE (owner_id = 1)
---
  def show
  	@my_checklists = Checklist.paginate :page => params[:page], :order => 'created_at DESC', :conditions => ["owner_id = ?", current_user.id]