app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "last_name", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "first_name", "email") VALUES('L1wJNkeLgLrBpr3h3HPO', '2010-11-26 03:49:25.473209', '2010-11-26 03:49:25.473801', '01f0be40f572e682d71e8e7e89bf0b58dd803ca6e577c5019b92f88307da3ccc12d7399d9b4a8f5ff09d0037db79b2a64998be235b47c3797b9e2d8da801cedf', 'ldsDowToPBnU1L5zXqBp', '2010-11-26 03:49:25.473801', 0, '127.0.0.1', '1BnGaaTivHUdvoWBwIJy', '2010-11-26 03:49:25.469302', 'Veasna', '775249e28ae67e2c3f1c0cf933bcda54d28efddce5418c2ab82e993133fa2330bc6f1ea739d0e2348c40add2475e9356794f5a9357d9b91f623c2beb7f491147', 1, NULL, 'khem', NULL, 'Khem', 'asdf@asdf.com') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save